# MaterialElementId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Face..::..MaterialElementId Property
Face Class See Also
---
The element ID of the material from which this face is composed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId MaterialElementId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MaterialElementId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ MaterialElementId {
	ElementId^ get ();
}
```

# See Also
Face Class
Autodesk.Revit.DB Namespace